export const answer = [
    `ความเหมือน คือใช้ในการเก็บข้อมูลเหมือนกัน ความต่าง cookie สามารถอ่านได้จาก server ส่วน localStorage และ sessionStorage สามารถอ่านได้จาก client จึงทำให้ ส่วนของ localStorage และ sessionStorage ทำงานได้เร็วกว่า cookie และมีขนาดเก็บที่ใหญ่กว่า cookie ด้วย(cookie 4KB, localStorage, sessionStorage 5MB ต่อโดเมน) ส่วน localStorage และ sessionStorage เหมือนกันเกือบทุกอย่าง ต่างกันตรงที่การ clear ข้อมูล ของ localStorage ไม่มีวันหมดอายุ จนกว่าจะลบเองหรือกำหนดวันหมดอายุ ส่วนของ sessionStorage จะถูกลบเสมอเมื่อทำการปิดแท๊บนั้นๆ`,
    `ยังจำเป็นอยู่เนื่องจาก hooks นั้นมีเงื่อนไขการใช้งานอยู่ เช่นกรณี ที่มีการเรียก component แบบวนลูปเดิม โดยไม่ควรใช้ hooks หรือการนำ condition มาครอบ hooks`,
    `คือการ จัดการ DOM โดยการเก็บ Tag ของ DOM ไว้ทำให้เข้าถึง DOM โดยผ่าน reference ของข้อมูลทำให้ลดเวลาในการค้นหาผ่านรูปแบบของ tree ทำให้รวดเร็วกว่าการจัดการ DOM แบบตรงๆ`,
    `ออกแบบให้ มี store ส่วนกลาง ที่ทุก component สามารถดึงข้อมูลจากส่วนกลางนี้ได้ เพื่อให้ง่ายต่อการ debug เมื่อเกิด error ขี้น เช่น Hooks, Redux หรือ Recoil เป็นต้น`,
    `-relative เป็นการกำหนดตำแหน่งของ element โดยสามารถ ใช้ top left right bottom ได้ เพื่อกำหนดตำแหน่งของ element
    -absolute เป็นการกำหนดตำแหน่งแบบอิสระ ไม่สนใจ element ก่อนหน้าทำให้ เกิดการทับกัน จึงจำเป็นต้องใช้ relative กำหนดเพื่อเป็นกรอบให้ absolute
    -fixed เป็นการกำนหด element บนตำแหน่งบนหน้าจอ`,
    `-callback ใช้กรณีที่ ต้องการทำผลลัพธ์จาก function นำมาประมวลผลต่อ แต่ถ้าใช้ประมวลผลต่อเป็นจำนวนมากๆ จะทำให้เกิด สิ่งที่เรียกว่า callback hell เพราะเนื่องจากต้องมี function ในการส่งไปเพื่อให้เรียกใช้เมื่อประมวลเสร็จสิ้น
    -promise เป็นการแก้ปัญหา ของ callback hell ที่มีการประมวลผลต่อเป็นลูกโซ่ ทำให้สามารถอ่าน code ได้เข้าใจง่ายกว่า และมี  Promise All ที่สามารถให้ทุก function ประมวลผลพร้อมกัน และรอจนกว่าจะเสร็จพร้อมกันถึงจะนำผลลัพธ์ไปทำงานต่อ ใช้ในกรณีที่ทุก function ทำงานแยกกันอย่างอิสระ และต้องการให้ทำงานพร้อมกัน
    -async/ await เป็นการแก้ปัญหา ของ callback hell แบบเดียวกับ promise ต่างกันที่รูปแบบการเขียน code ซึ่งโดยรวมแล้ว การเขียนแบบนี้ จะคล้ายกับ การเขียน Code Synchronous ของภาษาอื่นๆ`
]